---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.ExtraOffset
source: html/5e93cb7b-11f9-343d-747b-4b8249cde082.htm
---
# Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.ExtraOffset Property

The extra offset determined from the geometry of the family instance.

## Syntax (C#)
```csharp
public XYZ ExtraOffset { get; }
```